Catalogs/АР_ГрафикиИзмененияСтавокНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>АР_ГрафикиИзмененияСтавокНаУслуги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикСтавок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ГрафикиИзмененияСтавокНаУслуги/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", ЭтоПостояннаяЧасть);
		ПараметрыФормы.Вставить("ДокументВладелец", ДокументВладелец);
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);

		ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы);
		ФормаГрафика.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ЭтоПостояннаяЧасть", ЭтоПостояннаяЧасть);
	Параметры.Свойство("ДокументВладелец", ДокументВладелец);
	Параметры.Свойство("Услуга", Услуга);
	Параметры.Свойство("ОбъектАренды", ОбъектАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", ЭтоПостояннаяЧасть);
	ПараметрыФормы.Вставить("ДокументВладелец", ДокументВладелец);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);

	ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы, Элемент);
	ФормаГрафика.Объект.Владелец = АР_ОбщиеПроцедуры.ЗначениеРеквизитаОбъекта(ДокументВладелец, "ДоговорКонтрагента");
	ФормаГрафика.Объект.Документ = ДокументВладелец;
	ФормаГрафика.Объект.Наименование = "График изменения ставок по услуге """ + Услуга + """ и объекту """ + ОбъектАренды + """";
	
	Если Копирование Тогда
		ПолучитьГрафикСтавокНаСервере(ТекущиеДанные.Ссылка);
		Для Каждого Строк Из ГрафикСтавок Цикл
			Стр = ФормаГрафика.Объект.ГрафикСтавок.Добавить();
			Стр.Дата = Строк.Дата;
			Стр.Ставка = Строк.Ставка;
		КонецЦикла;
	КонецЕсли;
	
	ФормаГрафика.ЗакрыватьПриВыборе = Ложь;
	ФормаГрафика.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьГрафикСтавокНаСервере(Ссылка)
	
	ГрафикСтавок.Очистить();
	Для Каждого Строк Из Ссылка.ГрафикСтавок Цикл
		Стр = ГрафикСтавок.Добавить();
		Стр.Дата = Строк.Дата;
		Стр.Ставка = Строк.Ставка;
	КонецЦикла;
	
КонецПроцедуры
